MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECH124/mcu.h
extern volatile __OFF032bits_t OFF032bits __asm__ ("OFF032") __attribute__((section("sfrs"), address(0xBF8105C0)));
#define OFF033 OFF033
extern volatile uint32_t   OFF033 __attribute__((section("sfrs"), address(0xBF8105C4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF033bits_t;
extern volatile __OFF033bits_t OFF033bits __asm__ ("OFF033") __attribute__((section("sfrs"), address(0xBF8105C4)));
#define OFF034 OFF034
extern volatile uint32_t   OFF034 __attribute__((section("sfrs"), address(0xBF8105C8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF034bits_t;
extern volatile __OFF034bits_t OFF034bits __asm__ ("OFF034") __attribute__((section("sfrs"), address(0xBF8105C8)));
#define OFF035 OFF035
extern volatile uint32_t   OFF035 __attribute__((section("sfrs"), address(0xBF8105CC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF035bits_t;
extern volatile __OFF035bits_t OFF035bits __asm__ ("OFF035") __attribute__((section("sfrs"), address(0xBF8105CC)));
#define OFF036 OFF036
extern volatile uint32_t   OFF036 __attribute__((section("sfrs"), address(0xBF8105D0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF036bits_t;
extern volatile __OFF036bits_t OFF036bits __asm__ ("OFF036") __attribute__((section("sfrs"), address(0xBF8105D0)));
#define OFF037 OFF037
extern volatile uint32_t   OFF037 __attribute__((section("sfrs"), address(0xBF8105D4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF037bits_t;
extern volatile __OFF037bits_t OFF037bits __asm__ ("OFF037") __attribute__((section("sfrs"), address(0xBF8105D4)));
#define OFF038 OFF038
extern volatile uint32_t   OFF038 __attribute__((section("sfrs"), address(0xBF8105D8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF038bits_t;
extern volatile __OFF038bits_t OFF038bits __asm__ ("OFF038") __attribute__((section("sfrs"), address(0xBF8105D8)));
#define OFF039 OFF039
extern volatile uint32_t   OFF039 __attribute__((section("sfrs"), address(0xBF8105DC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF039bits_t;
extern volatile __OFF039bits_t OFF039bits __asm__ ("OFF039") __attribute__((section("sfrs"), address(0xBF8105DC)));
#define OFF040 OFF040
extern volatile uint32_t   OFF040 __attribute__((section("sfrs"), address(0xBF8105E0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF040bits_t;
extern volatile __OFF040bits_t OFF040bits __asm__ ("OFF040") __attribute__((section("sfrs"), address(0xBF8105E0)));
#define OFF041 OFF041
extern volatile uint32_t   OFF041 __attribute__((section("sfrs"), address(0xBF8105E4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF041bits_t;
extern volatile __OFF041bits_t OFF041bits __asm__ ("OFF041") __attribute__((section("sfrs"), address(0xBF8105E4)));
#define OFF042 OFF042
extern volatile uint32_t   OFF042 __attribute__((section("sfrs"), address(0xBF8105E8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF042bits_t;
extern volatile __OFF042bits_t OFF042bits __asm__ ("OFF042") __attribute__((section("sfrs"), address(0xBF8105E8)));
#define OFF043 OFF043
extern volatile uint32_t   OFF043 __attribute__((section("sfrs"), address(0xBF8105EC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF043bits_t;
extern volatile __OFF043bits_t OFF043bits __asm__ ("OFF043") __attribute__((section("sfrs"), address(0xBF8105EC)));
#define OFF044 OFF044
extern volatile uint32_t   OFF044 __attribute__((section("sfrs"), address(0xBF8105F0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF044bits_t;
extern volatile __OFF044bits_t OFF044bits __asm__ ("OFF044") __attribute__((section("sfrs"), address(0xBF8105F0)));
#define OFF046 OFF046
extern volatile uint32_t   OFF046 __attribute__((section("sfrs"), address(0xBF8105F8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF046bits_t;
extern volatile __OFF046bits_t OFF046bits __asm__ ("OFF046") __attribute__((section("sfrs"), address(0xBF8105F8)));
#define OFF047 OFF047
extern volatile uint32_t   OFF047 __attribute__((section("sfrs"), address(0xBF8105FC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF047bits_t;
extern volatile __OFF047bits_t OFF047bits __asm__ ("OFF047") __attribute__((section("sfrs"), address(0xBF8105FC)));
#define OFF048 OFF048
extern volatile uint32_t   OFF048 __attribute__((section("sfrs"), address(0xBF810600)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF048bits_t;
extern volatile __OFF048bits_t OFF048bits __asm__ ("OFF048") __attribute__((section("sfrs"), address(0xBF810600)));
#define OFF049 OFF049
extern volatile uint32_t   OFF049 __attribute__((section("sfrs"), address(0xBF810604)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF049bits_t;
extern volatile __OFF049bits_t OFF049bits __asm__ ("OFF049") __attribute__((section("sfrs"), address(0xBF810604)));
#define OFF050 OFF050
extern volatile uint32_t   OFF050 __attribute__((section("sfrs"), address(0xBF810608)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF050bits_t;
extern volatile __OFF050bits_t OFF050bits __asm__ ("OFF050") __attribute__((section("sfrs"), address(0xBF810608)));
#define OFF051 OFF051
extern volatile uint32_t   OFF051 __attribute__((section("sfrs"), address(0xBF81060C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF051bits_t;
extern volatile __OFF051bits_t OFF051bits __asm__ ("OFF051") __attribute__((section("sfrs"), address(0xBF81060C)));
#define OFF052 OFF052
extern volatile uint32_t   OFF052 __attribute__((section("sfrs"), address(0xBF810610)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF052bits_t;
extern volatile __OFF052bits_t OFF052bits __asm__ ("OFF052") __attribute__((section("sfrs"), address(0xBF810610)));
#define OFF053 OFF053
extern volatile uint32_t   OFF053 __attribute__((section("sfrs"), address(0xBF810614)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF053bits_t;
extern volatile __OFF053bits_t OFF053bits __asm__ ("OFF053") __attribute__((section("sfrs"), address(0xBF810614)));
#define OFF054 OFF054
extern volatile uint32_t   OFF054 __attribute__((section("sfrs"), address(0xBF810618)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF054bits_t;
extern volatile __OFF054bits_t OFF054bits __asm__ ("OFF054") __attribute__((section("sfrs"), address(0xBF810618)));
#define OFF055 OFF055
extern volatile uint32_t   OFF055 __attribute__((section("sfrs"), address(0xBF81061C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF055bits_t;
extern volatile __OFF055bits_t OFF055bits __asm__ ("OFF055") __attribute__((section("sfrs"), address(0xBF81061C)));
#define OFF056 OFF056
extern volatile uint32_t   OFF056 __attribute__((section("sfrs"), address(0xBF810620)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF056bits_t;
extern volatile __OFF056bits_t OFF056bits __asm__ ("OFF056") __attribute__((section("sfrs"), address(0xBF810620)));
#define OFF057 OFF057
extern volatile uint32_t   OFF057 __attribute__((section("sfrs"), address(0xBF810624)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF057bits_t;
