MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECH124/mcu.h
extern volatile __OFF180bits_t OFF180bits __asm__ ("OFF180") __attribute__((section("sfrs"), address(0xBF810810)));
#define OFF181 OFF181
extern volatile uint32_t   OFF181 __attribute__((section("sfrs"), address(0xBF810814)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF181bits_t;
extern volatile __OFF181bits_t OFF181bits __asm__ ("OFF181") __attribute__((section("sfrs"), address(0xBF810814)));
#define OFF182 OFF182
extern volatile uint32_t   OFF182 __attribute__((section("sfrs"), address(0xBF810818)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF182bits_t;
extern volatile __OFF182bits_t OFF182bits __asm__ ("OFF182") __attribute__((section("sfrs"), address(0xBF810818)));
#define OFF183 OFF183
extern volatile uint32_t   OFF183 __attribute__((section("sfrs"), address(0xBF81081C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF183bits_t;
extern volatile __OFF183bits_t OFF183bits __asm__ ("OFF183") __attribute__((section("sfrs"), address(0xBF81081C)));
#define OFF184 OFF184
extern volatile uint32_t   OFF184 __attribute__((section("sfrs"), address(0xBF810820)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF184bits_t;
extern volatile __OFF184bits_t OFF184bits __asm__ ("OFF184") __attribute__((section("sfrs"), address(0xBF810820)));
#define OFF185 OFF185
extern volatile uint32_t   OFF185 __attribute__((section("sfrs"), address(0xBF810824)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF185bits_t;
extern volatile __OFF185bits_t OFF185bits __asm__ ("OFF185") __attribute__((section("sfrs"), address(0xBF810824)));
#define OFF186 OFF186
extern volatile uint32_t   OFF186 __attribute__((section("sfrs"), address(0xBF810828)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF186bits_t;
extern volatile __OFF186bits_t OFF186bits __asm__ ("OFF186") __attribute__((section("sfrs"), address(0xBF810828)));
#define OFF187 OFF187
extern volatile uint32_t   OFF187 __attribute__((section("sfrs"), address(0xBF81082C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF187bits_t;
extern volatile __OFF187bits_t OFF187bits __asm__ ("OFF187") __attribute__((section("sfrs"), address(0xBF81082C)));
#define OFF188 OFF188
extern volatile uint32_t   OFF188 __attribute__((section("sfrs"), address(0xBF810830)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF188bits_t;
extern volatile __OFF188bits_t OFF188bits __asm__ ("OFF188") __attribute__((section("sfrs"), address(0xBF810830)));
#define OFF189 OFF189
extern volatile uint32_t   OFF189 __attribute__((section("sfrs"), address(0xBF810834)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF189bits_t;
extern volatile __OFF189bits_t OFF189bits __asm__ ("OFF189") __attribute__((section("sfrs"), address(0xBF810834)));
#define OFF190 OFF190
extern volatile uint32_t   OFF190 __attribute__((section("sfrs"), address(0xBF810838)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF190bits_t;
extern volatile __OFF190bits_t OFF190bits __asm__ ("OFF190") __attribute__((section("sfrs"), address(0xBF810838)));
#define DMACON DMACON
extern volatile uint32_t   DMACON __attribute__((section("sfrs"), address(0xBF811000)));
typedef struct {
  uint32_t :11;
  uint32_t DMABUSY:1;
  uint32_t SUSPEND:1;
  uint32_t :2;
  uint32_t ON:1;
} __DMACONbits_t;
extern volatile __DMACONbits_t DMACONbits __asm__ ("DMACON") __attribute__((section("sfrs"), address(0xBF811000)));
extern volatile uint32_t        DMACONCLR __attribute__((section("sfrs"),address(0xBF811004)));
extern volatile uint32_t        DMACONSET __attribute__((section("sfrs"),address(0xBF811008)));
extern volatile uint32_t        DMACONINV __attribute__((section("sfrs"),address(0xBF81100C)));
#define DMASTAT DMASTAT
extern volatile uint32_t   DMASTAT __attribute__((section("sfrs"), address(0xBF811010)));
typedef struct {
  uint32_t DMACH:3;
  uint32_t :28;
  uint32_t RDWR:1;
} __DMASTATbits_t;
extern volatile __DMASTATbits_t DMASTATbits __asm__ ("DMASTAT") __attribute__((section("sfrs"), address(0xBF811010)));
extern volatile uint32_t        DMASTATCLR __attribute__((section("sfrs"),address(0xBF811014)));
extern volatile uint32_t        DMASTATSET __attribute__((section("sfrs"),address(0xBF811018)));
extern volatile uint32_t        DMASTATINV __attribute__((section("sfrs"),address(0xBF81101C)));
#define DMAADDR DMAADDR
extern volatile uint32_t   DMAADDR __attribute__((section("sfrs"), address(0xBF811020)));
typedef struct {
  uint32_t DMAADDR:32;
} __DMAADDRbits_t;
extern volatile __DMAADDRbits_t DMAADDRbits __asm__ ("DMAADDR") __attribute__((section("sfrs"), address(0xBF811020)));
extern volatile uint32_t        DMAADDRCLR __attribute__((section("sfrs"),address(0xBF811024)));
extern volatile uint32_t        DMAADDRSET __attribute__((section("sfrs"),address(0xBF811028)));
extern volatile uint32_t        DMAADDRINV __attribute__((section("sfrs"),address(0xBF81102C)));
#define DCRCCON DCRCCON
extern volatile uint32_t   DCRCCON __attribute__((section("sfrs"), address(0xBF811030)));
typedef struct {
  uint32_t CRCCH:3;
  uint32_t :2;
  uint32_t CRCTYP:1;
  uint32_t CRCAPP:1;
  uint32_t CRCEN:1;
  uint32_t PLEN:5;
  uint32_t :11;
  uint32_t BITO:1;
  uint32_t :2;
  uint32_t WBO:1;
  uint32_t BYTO:2;
} __DCRCCONbits_t;
extern volatile __DCRCCONbits_t DCRCCONbits __asm__ ("DCRCCON") __attribute__((section("sfrs"), address(0xBF811030)));
extern volatile uint32_t        DCRCCONCLR __attribute__((section("sfrs"),address(0xBF811034)));
extern volatile uint32_t        DCRCCONSET __attribute__((section("sfrs"),address(0xBF811038)));
extern volatile uint32_t        DCRCCONINV __attribute__((section("sfrs"),address(0xBF81103C)));
#define DCRCDATA DCRCDATA
extern volatile uint32_t   DCRCDATA __attribute__((section("sfrs"), address(0xBF811040)));
typedef struct {
  uint32_t DCRCDATA:32;
} __DCRCDATAbits_t;
extern volatile __DCRCDATAbits_t DCRCDATAbits __asm__ ("DCRCDATA") __attribute__((section("sfrs"), address(0xBF811040)));
extern volatile uint32_t        DCRCDATACLR __attribute__((section("sfrs"),address(0xBF811044)));
extern volatile uint32_t        DCRCDATASET __attribute__((section("sfrs"),address(0xBF811048)));
extern volatile uint32_t        DCRCDATAINV __attribute__((section("sfrs"),address(0xBF81104C)));
#define DCRCXOR DCRCXOR
extern volatile uint32_t   DCRCXOR __attribute__((section("sfrs"), address(0xBF811050)));
typedef struct {
  uint32_t DCRCXOR:32;
} __DCRCXORbits_t;
extern volatile __DCRCXORbits_t DCRCXORbits __asm__ ("DCRCXOR") __attribute__((section("sfrs"), address(0xBF811050)));
extern volatile uint32_t        DCRCXORCLR __attribute__((section("sfrs"),address(0xBF811054)));
extern volatile uint32_t        DCRCXORSET __attribute__((section("sfrs"),address(0xBF811058)));
extern volatile uint32_t        DCRCXORINV __attribute__((section("sfrs"),address(0xBF81105C)));
#define DCH0CON DCH0CON
extern volatile uint32_t   DCH0CON __attribute__((section("sfrs"), address(0xBF811060)));
typedef struct {
  uint32_t CHPRI:2;
  uint32_t CHEDET:1;
  uint32_t :1;
  uint32_t CHAEN:1;
  uint32_t CHCHN:1;
  uint32_t CHAED:1;
  uint32_t CHEN:1;
  uint32_t CHCHNS:1;
  uint32_t :2;
  uint32_t CHPATLEN:1;
  uint32_t :1;
  uint32_t CHPIGNEN:1;
  uint32_t :1;
  uint32_t CHBUSY:1;
  uint32_t :8;
  uint32_t CHPIGN:8;
} __DCH0CONbits_t;
extern volatile __DCH0CONbits_t DCH0CONbits __asm__ ("DCH0CON") __attribute__((section("sfrs"), address(0xBF811060)));
extern volatile uint32_t        DCH0CONCLR __attribute__((section("sfrs"),address(0xBF811064)));
extern volatile uint32_t        DCH0CONSET __attribute__((section("sfrs"),address(0xBF811068)));
extern volatile uint32_t        DCH0CONINV __attribute__((section("sfrs"),address(0xBF81106C)));
#define DCH0ECON DCH0ECON
extern volatile uint32_t   DCH0ECON __attribute__((section("sfrs"), address(0xBF811070)));
typedef struct {
  uint32_t :3;
  uint32_t AIRQEN:1;
  uint32_t SIRQEN:1;
  uint32_t PATEN:1;
  uint32_t CABORT:1;
  uint32_t CFORCE:1;
  uint32_t CHSIRQ:8;
  uint32_t CHAIRQ:8;
} __DCH0ECONbits_t;
